# VoltageDrop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..VoltageDrop Property
ElectricalSystem Class See Also
---
The VoltageDrop value of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double VoltageDrop { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VoltageDrop As Double
	Get
```

Visual C++
---
```text
public:
property double VoltageDrop {
	double get ();
}
```

# Remarks
This property is used to retrieve the VoltageDrop value of the Electrical System.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This property only available when System Type is Power! -or- Thrown when the voltage drop cannot be computed, because it is zero, or because the circuit is not connected to a panel. |

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace